In [361]:
import sys
sys.path.append('../')

In [362]:
import numpy as np
import pandas as pd
import math
from data_split import k_fold_split

In [363]:
df = pd.read_excel("../data/2-PreferenciasBritanicos(TP1).xlsx")
df

    scones  cerveza  wiskey  avena  futbol Nacionalidad
0        0        0       1      1       1            I
1        1        0       1      1       0            I
2        1        1       0      0       1            I
3        1        1       0      0       0            I
4        0        1       0      0       1            I
5        0        0       0      1       0            I
6        1        0       0      1       1            E
7        1        1       0      0       1            E
8        1        1       1      1       0            E
9        1        1       0      1       0            E
10       1        1       0      1       1            E
11       1        0       1      1       0            E
12       1        0       1      0       0            E

In [364]:
random_generator = np.random.default_rng(seed=42)

In [365]:
k = 2

In [366]:
test_size = df.shape[0] / k
(test_size * (k-1), test_size)

(6.5, 6.5)

In [367]:
train_df, test_df = k_fold_split(df, k, random_generator)

In [368]:
train_df

  scones cerveza wiskey avena futbol Nacionalidad
8      1       1      1     1      0            E
0      0       0      1     1      1            I
6      1       0      0     1      1            E
5      0       0      0     1      0            I
4      0       1      0     0      1            I
7      1       1      0     0      1            E
9      1       1      0     1      0            E

In [369]:
test_df

   scones cerveza wiskey avena futbol Nacionalidad
3       1       1      0     0      0            I
11      1       0      1     1      0            E
2       1       1      0     0      1            I
1       1       0      1     1      0            I
10      1       1      0     1      1            E
12      1       0      1     0      0            E